app/Http/Controllers/PostController.php

    public function index() {
        $posts = Post::withTrashed()->paginate(3);
---
select * from `posts` limit 3 offset 0
select count(*) as aggregate from `posts`

    public function paginate($page) {
        $per_page = 3;
        $posts = Post::withTrashed()->paginate($per_page, ['*'], 'page', $page);
---
select * from `posts` limit 3 offset 0
select count(*) as aggregate from `posts`

    public function create(){
        $users = User::all();
---
select * from `users`

    public function new1($id){
        $comments = Comment::all();
        $users = User::all();
---
select * from `comments`
select * from `users`

    public function store(){
        $data = request()->all();
        if(isset($data['id'])) {
            Post::where('id', $data['id'])->update([
                'title' => $data['title'],
                'description' => $data['description'],
                'user_id' => $data['post_creator'],
            ]);
        } else {

            Post::create([
                'title' => $data['title'],
                'description' => $data['description'],
                'user_id' => $data['post_creator'],
            ]);
---
update `posts` set `title` = 'my first post', `description` = 'hello in my firest post', `user_id` = '1', `posts`.`updated_at` = '2022-04-18 12:24:35' where `id` = '1' and `posts`.`deleted_at` is null
insert into `posts` (`title`, `description`, `user_id`, `updated_at`, `created_at`) values ('asdasd', 'dsasdd', '1', '2022-04-18 19:26:29', '2022-04-18 19:26:29')

    public function storeComment(){
        $data = request()->all();


            Comment::create([
                'comment' => $data['addcomm'],
                'user_id'=>$data['post_creator'],
                'post_id'=>$data['id'],




            ]);
---
insert into `comments` (`comment`, `user_id`, `post_id`, `updated_at`, `created_at`) values ('sfsfdsfsd', '1', '1', '2022-04-18 19:26:36', '2022-04-18 19:26:36')

    public function show($postId){
        $post = Post::find($postId);
        $comments=Comment::all();
---
select * from `posts` where `posts`.`id` = '2' and `posts`.`deleted_at` is null limit 1
select * from `comments`