app/Http/Controllers/PostController.php

select * from `users`
---
    public function edit($postId){
        $users = User::all();

update `posts` set `deleted_at` = '2022-04-18 12:24:48', `posts`.`updated_at` = '2022-04-18 12:24:48' where `id` = '1' and `posts`.`deleted_at` is null
---
    public function restore($postId) {
        Post::where('id', $postId)->restore();

update `posts` set `deleted_at` = '', `posts`.`updated_at` = '2022-04-18 12:24:52' where `id` = '1'
---
    public function force_destroy($postId) {
        Post::where('id', $postId)->forceDelete();
        return redirect()->route('posts.index');
    }



         Post::delete($postId);